<!-- html部分 -->
<template>
	<div>
			<h1 class="h1">企业能耗比对比图</h1>
			<ve-line  :data="chartData1"></ve-line>			
		  <h1 class="h1">企业作业量对比图</h1>
		  <ve-histogram :data="chartData2"></ve-histogram>
	</div>
</template>
<!-- js部分 -->
<script>
	export default {
		name:'',
		data() {
			return {
				  chartData1: {
          columns: ['日期', '周口港', '上海港', '北京港'],
          rows: [
            { '日期': '1月', '周口港': 1393, '上海港': 1093, '北京港': 0.32 },
            { '日期': '1/2', '周口港': 3530, '上海港': 3230, '北京港': 0.26 },
            { '日期': '1/3', '周口港': 2923, '上海港': 2623, '北京港': 0.76 },
            { '日期': '1/4', '周口港': 1723, '上海港': 1423, '北京港': 0.49 },
            { '日期': '1/5', '周口港': 3792, '上海港': 3492, '北京港': 0.323 },
            { '日期': '1/6', '周口港': 4593, '上海港': 4293, '北京港': 555}
          ]
        },
		chartData2: {
		  columns: ['日期', '周口港', '上海港', '北京港'],
		  rows: [
		     { '日期': '1月', '周口港': 1393, '上海港': 1093, '北京港': 0.32 },
		   { '日期': '1/2', '周口港': 3530, '上海港': 3230, '北京港': 0.26 },
		   { '日期': '1/3', '周口港': 2923, '上海港': 2623, '北京港': 0.76 },
		   { '日期': '1/4', '周口港': 1723, '上海港': 1423, '北京港': 0.49 },
		   { '日期': '1/5', '周口港': 3792, '上海港': 3492, '北京港': 0.323 },
		   { '日期': '1/6', '周口港': 4593, '上海港': 4293, '北京港': 555}
		  ]
		}
				
				
				
			};
		},
		methods:{
			
		}
	}
</script>
<!-- css部分 -->
<style>
.h1{
	text-align: center;
}
 
</style>
